{
  "usage": "index of lab projects",
  "entry": [
    {
      "category":"博士后招聘启事",
      "items":[
        "<center><h2>上海交通大学李柠教授课题组博士后招聘启事</h2><center>",
        "<h3>课题组简介</h3>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;李柠教授课题组隶属于上海交通大学电子信息与电气工程学院自动化系自动化研究所。课题组以国家重大战略需求与前沿基础理论为目标导向，承担国家自然科学基金、科技部重点研发项目、重点企业开发创新等项目，主要开展包括分布式优化、健康管理与故障诊断、机器人控制、计算机视觉、深度学习与强化学习等理论与实际工业应用的研究。",
        "<h3>一、招聘条件</h3>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1、拥护中国共产党领导。身体思想健康，具有团队合作精神，对实验室研究方向具有浓厚兴趣，年龄在35周岁以下。",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2、国内外知名高校或研究机构取得相关专业博士学位，外语水平良好。",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3、在相关领域期刊与会议上发表高水平研究论文，对本领域基础知识与国际最新研究进展有良好的把握与思路。",
        "<h3>二、岗位描述</h3>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;岗位1：控制与优化算法研究（e.g. 多智能体，动态规划）",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;岗位2：工业过程的故障诊断技术",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;岗位3：机器人技术（e.g. 机器视觉，优化与控制）",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;岗位4：大数据分析，模式识别与图像处理",
        "<h3>三、岗位职责</h3>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. 积极参与课题组或独立承担研究项目；",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. 发表高水平学术论文；",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3. 独立/协助申报各类科研项目；",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4. 协助指导本科生/研究生工作和实验室日常管理。",
        "<h3>四、岗位待遇</h3>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1.享受上海交通大学博士后福利待遇（<a href='http://postd.sjtu.edu.cn/'>http://postd.sjtu.edu.cn/</a>），年薪不少于24万元（含五险一金及租房补贴）；获上海市超级博后资助者年薪不少于35万元；特别优秀者薪资一事一议。",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2.享受上海交通大学博士后住房补贴或申请博士后公寓。",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3. 鼓励和支持博士后在站期间申报国家和省市级博士后人才项目和研究项目，获资助者就高享受相关待遇。",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4. 按照上海市和上海交通大学博士后管理政策办理有关落户事宜，享受社会保险、公积金等福利待遇；博士后出站留上海工作，配偶及子女可随迁落户。",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5. 根据学校最新政策，鼓励博士后长期稳定工作（2-3年），优秀博士后出站，满足我校长聘教轨条件者，可直接申请应聘长聘教轨教职。",
        "<h3>五、材料提供</h3>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. 个人简历（简介，学习工作经历，发表论文，参与项目，学术计划）与博士学历学位身份证扫描件",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. 三篇代表性论文或著作以及其他可以证明本人研究能力的相关材料",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3. 两封领域内专家推荐信（附联系方式）",
        "<h3>六、联系方式</h3>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;实验室主页：<a href='https://ning.sjtu.edu.cn'>https://ning.sjtu.edu.cn</a>",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;联系人：王老师",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;E- mail: jundawang@sjtu.edu.cn",
        "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;地址：上海闵行区东川路800号上海交通大学电院自动化系"
      ]
    },
    {
      "category":"科研奖励",
      "items":[
        "2016年CAA自然科学奖一等奖：网络化大系统的分布式预测控制理论与方法。 李少远，郑毅，李德伟，李柠，席裕庚",
        "Li Shaoyuan, Zheng Yi, Li Dewei, Li Ning, Xi Yugen. Distributed Predictive Control Theory and Method of Networked Systems. CAA Natural Science Award (First Prize), 2016",
        "2006年上海市科学技术进步奖（自然科学类）一等奖：约束工业过程的满意优化控制理论及应用。 李少远，王景成，李柠，席裕庚",
        "Li Shaoyuan, Wang Jingcheng, Li Ning, Xi Yugeng. Satisfying Optimal Control Theory and Applications for Constrained Industrial Processes. Science and Technology Progress Award of Shanghai (First Prize), 2006"
      ]
    },
    {
      "category": "国家级课题",
      "items": [
        "国家自然基金面上项目：基于数据学习模型的风电场机组分布式滚动优化调度，主持，2018.01-2021.12",
        "Distributed Rolling Optimal Scheduling for Wind Turbine Generators Based on Data Learning Model. National Science Foundation of China (61773260), PI, 2018.01-2021.12",
        "国家自然科学基金重大项目：炼油生产过程全局优化运行的基础理论与关键技术，主研，2016.01-2020.12",
        "Basic Theory and Key Technology of Global Optimization Operation in Refinery Production Process. National Natural Science Foundation (61590920), Member, 2016.01-2020.12",
        "国家自然科学基金重大项目重点项目：炼油生产过程全局优化运行的实验平台与应用验证，本单位负责人，2016.01-2020.12",
        "Experimental Platform and Application Verification of Global Optimization Operation in Refinery Production Process. National Natural Science Foundation (61590925), Co-PI, 2016.01-2020.12",
        "863子课题：焊接操作实时运动控制方法及实施现场三维重构与精确定标方法，主研，2015.3-2018.3",
        "Real-time Motion Control Method of Welding Operation and Implementation of Three - Dimensional Reconstruction and Precise Calibration Method. National 863 Project, Member, 2015.03-2018.03",
        "国家自然科学基金面上项目：带有约束的自适应预测控制系统性能极限分析，主持，2014.01-2017.12",
        "Performance Limitation Analysis of Constrained Adaptive Predictive Control System. National Science Foundation of China (61374109), PI, 2014.01-2017.12",
        "973计划子课题：核电站紧急救灾机器人的基础科学问题，主研，2013.01-2017.08",
        "Basic Scientific Problems of Emergency Relief Robot for Nuclear Power Plant. National 973 Project (2013CB035500), Member, 2013.01-2017.08",
        "国家自然科学基金：数据驱动的预测控制器设计与性能监控，主持，2011.01-2013.12",
        "Data-driven Predictive Controller Design and Performance Monitoring. National Natural Science Foundation (61074061), PI, 2011.01-2013.12",
        "863计划资助课题：四足仿生机器人动态控制，主研，2011.01-2013.12",
        "Dynamic Control of Four-leg Bionic Robots. National 863 Project, Member, 2011.01-2013.12",
        "国家自然基金重点：约束模型预测控制的理论和高效算法，主研，2010.01-2013.12",
        "Theory and Efficient Algorithm of Constrained Model Predictive Control. National Science Foundation of China (60934007), Member, 2010.01-2013.12",
        "国家自然科学基金：分布参数系统融合空间信息的模糊建模与控制，主持，2007.01-2009.12",
        "Fuzzy Modeling and Control for Distributed Parameter Systems with Spatial Information. National Natural Science Foundation (60604018), PI, 2007.01-2009.12",
        "863计划资助课题：网络信息模式下的生产全过程整体优化技术与应用，主研，2006.01-2008.12",
        "Global Optimization Technology and Application of Complex Processes under Networked Information Mode. National Key Technologies R&D Program (2006AA04Z173), 2006.01-2008.12"
      ]
    },
    {
      "category": "省部级课题",
      "items": [
         "上海交通大学晨星青年学者奖励计划(A类)：复杂系统的高效预测控制性能分析、设计及应用，主持，2014.12-2016.12",
         "Performance Analysis, Design and Application of Efficient Predictive Control for Complex Systems. SJTU Morningstar Young Scholars Program (Class A), PI, 2014.12-2016.12",
         "上海市科技创新计划国际合作项目：面向节能降耗的新型ACB式HVAC空调系统，主研，2012.10-2014.09",
         "Novel ACB-type HVAC Air Conditioning System for Energy Saving and Consumption Reduction. International Cooperation Project of Shanghai Science and Technology Innovation Program, Member, 2012.10-2014.09",
         "上海市经信委子课题：分布式光伏微小逆变设备研发与产业化，主持，2012.01-2015.12",
         "Research and Development of Distributed Photovoltaic Mini Inverter Equipment. Project of Shanghai Economic and Information Commission, PI, 2012.01-2015.12",
         "上海教委科研创新重点项目：消相干效应下的量子控制和优化设计，主研，2011.01-2013.12",
         "Quantum Control and Optimization Design under Decoherence Effect. Key Project of Scientific Research and Innovation of Shanghai Education Commission, Member, 2011.01-2013.12",
         "铁道部科技研究开发计划重点课题：高速动车组牵引预测控制技术方案的研究，主研，2011.01-2012.12",
         "Research on Technical Scheme of Traction Predictive Control for High-speed EMU. Key Project of Technology Research and Development Program of Ministry of Railways, Member, 2011.01-2012.12",
         "上海科委基础研究重点项目子课题：基于化工过程机理与运行信息融合的过程控制与优化理论方法及工业应用， 主持，2010.10-2012.09",
         "Chemical Process Mechanism and Operation Information Based Process Control, Optimization and Applications. Key Project of Shanghai Science and Technology Commission (10JC1403400), PI, 2010.10-2012.09",
         "上海市科委信息化专项：钢铁生产合同组织排程优化技术研究，主研，2010.06-2011.09",
         "Research on Scheduling Optimization Technology of Steel Production Contract. Shanghai Science and Technology Commission information specialization, Member, 2010.06-2011.09",
         "上海市自然科学基金：燃煤机组SCR脱硝反应建模与控制技术研究，主持，2006.09-2008.08",
         "Modeling and Control of SCR De-NOx Systems, Shanghai Natural Science Foundation (06ZR14044), PI, 2006.09-2008.08"
      ]
    },
    {
      "category": "代表性企业课题",
      "items": [
        "基于多智能体技术的分布式能源网络系统优化控制方法，2016.12-2018.08",
        "Multi-Agent Technology Based Optimal Control of Distributed Energy Network Systems. 2016.12-2018.08",
        "基于大数据的风电智能化诊断模型，2016.10-2017.05",
        "Big Data Based Intelligent Diagnostic Model of Wind Power. 2016.10-2017.05"
      ]
    }
  ]
}
