{
  "usage": "index of publications",
  "entry": [
    {
      "category": "Journal Papers",
      "items": [
         "Z. Chen and  N. Li,  “An Optimal Control-Based Distributed Reinforcement Learning Framework for A Class of Non-Convex Objective Functionals of the Multi-Agent Network,” IEEE/CAA J. Autom. Sinica, 2022.",
         "Qinqin Fan, Bin Cao, Ning Li. Balancing broad and deep searches in evolutionary computation via a parallel zoning search. Evolutionary Intelligence, 2021. doi.org/10.1007/s12065-021-00572-3.",
         "Qinqin Fan, Yilian Zhang, Ning Li. An auto-selection strategy of multi-objective evolutionary algorithms based on performance-indicator and its application. IEEE Transactions on Automation Science and Engineering. 2021.",
         "Z. Chen, W. Xue, N. Li, B. Lian, and F. L. Lewis, A Novel Z-Function-Based Completely Model-Free Reinforcement Learning Method to Finite-Horizon Zero-Sum Game of Nonlinear System[J]. Nonlinear Dynamics. DOI:10.1007/s11071-021-07049-z.",
         "Z. Chen, W. Xue, N. Li, and F. L. Lewis, Two-loop Reinforcement Learning Algorithm for Finite-horizon Optimal Control of Continuous-Time Affine Nonlinear Systems[J]. International Journal of Robust and Nonlinear Control, 2021. DOI:10.1002/rnc.5826.",
         "Wang J, Zhang J, Jiang N, Song N, Xin J, Li N. Online health assessment and fault prediction for wind turbine generator. Proceedings of the Institution of Mechanical Engineers, Part I: Journal of Systems and Control Engineering. November 2021. doi:10.1177/09596518211056165",
         "D. Li, L. Yu, N. Li and F. L. Lewis. Virtual-Action-Based Coordinated Reinforcement Learning for Distributed Economic Dispatch, in IEEE Transactions on Power Systems, doi: 10.1109/TPWRS.2021.3070161.",
	 "D. Li, Li and F. Lewis. Projection-Free Distributed Optimization With Nonconvex Local Objective Functions and Resource Allocation Constraint. IEEE Transactions on Control of Network Systems, vol.8, no.1, pp.413-422, March 2021, doi: 10.1109/TCNS.2020.3027787.",
         "Jiang N, Hu X, Li N. Graphical temporal semi-supervised deep learning–based principal fault localization in wind turbine systems[J]. Proceedings of the Institution of Mechanical Engineers, Part I: Journal of Systems and Control Engineering. 2020: 0959651819901034.",
         "S. Kleff and N. Li. Robust Motion Planning in Dynamic Environments Based on Sampled-Data Hamilton-Jacobi Reachability. Robotica, 2020, 38(12):2151-2172.",
         "Jiang N, Li N. A wind turbine frequent principal fault detection and localization approach with imbalanced data using an improved synthetic oversampling technique[J]. International Journal of Electrical Power & Energy Systems, 126: 106595.",
         "Fan Q, Li N, Zhang Y, et al. Zoning search using a hyper-heuristic algorithm[J]. Science China Information Sciences, 2019, 62(9): 1-3.",
         "Yanting Xu, Guangming Zhang, Ning Li, Jing Zhang, Shaoyuan Li, and Lu Wang. Data Driven Performance Monitoring for Model Predictive Control Using an Overall Index Based on Mahalanobis Distance. Asian Journal of Control. 2019, 21(3): pp.1-17",
         "Jing Zhang, Na Jiang, Huike Li, Ning Li. Online Health Assessment of Wind Turbine Based on Operational Condition Recognition[J]. Transactions of the Institute of Measurement and Control. 2018",
         "Li D, Chen Z, Li N. Gap metric–based model bank construction for wind turbine predictive control[J]. Optimal Control Applications and Methods，2018, 39(5): 1610-1626",
         "Yuli Xu, Sheng Chen, Muhammad Javed, Ning Li, Zhongxue Gan. A Muti-occupants’confort driven and energy efficient control strategy of VAV system based on learned thermal comfort profiles. Science and Technology for the Built Environment.2018",
         "Li D, Tao X, Li N, et al. Switched Offline Multiple Model Predictive Control with Polyhedral Invariant Sets[J]. Industrial & Engineering Chemistry Research, 2017, 56(34): 9629-9637.(SCI)",
         "Tao X, Li D, Wang Y, et al. Gap-Metric-Based Multiple-Model Predictive Control with a Polyhedral Stability Region[J]. Industrial & Engineering Chemistry Research, 2015, 54(45): 11319-11329.(SCI)",
         "Tao X, Li N, Li S. Multiple model predictive control for large envelope flight of hypersonic vehicle systems[J]. Information Sciences, 2016, 328: 115-126.(ESI)",        
         "Cai X, Li S Y, Li N. Performance limits analysis of nonlinear model predictive control systems[J]. Journal of Optimization Theory and Applications, 2016, 168(1): 53-62.(SCI)",
         "Yang W, Li S, Li N. A switch-mode information fusion filter based on ISRUKF for autonomous navigation of spacecraft[J]. Information Fusion, 2014, 18: 33-42.(SCI)",
         "Wang L, Li N, Li S. Performance Monitoring of the Data-driven Subspace Predictive Control Systems Based on Historical Objective Function Benchmark[J]. Acta Automatica Sinica, 2013, 39(5): 542-547.",
         "Xue B, Li N, Li S, et al. Moving horizon scheduling for networked control systems with communication constraints[J]. IEEE Transactions on Industrial Electronics, 2013, 60(8): 3318-3327.(SCI/EI)",
         "Zheng Y, Li N, Li S. Hot-rolled strip laminar cooling process plant-wide temperature monitoring and control[J]. Control Engineering Practice, 2013, 21(1): 23-30.",
         "Wang M, Li N, Li S. Online correction MPC strategy for spatially-distributed system based on PCA method[J]. Journal of Control Theory and Applications, 2012, 10(1): 71-76.(EI)",
         "Li N, Hua C, Wang H, et al. Time–Space Decomposition-Based Generalized Predictive Control of a Transport-Reaction Process[J]. Industrial & Engineering Chemistry Research, 2011, 50(20): 11628-11635.(SCI/EI)",
         "Wang M L, Li N, Li S Y. Model-based predictive control for spatially-distributed systems using dimensional reduction models[J]. International Journal of Automation and computing, 2011, 8(1): 1-7.(EI)",
         "Yang H, Li N, Li S. A data‐driven bilinear predictive controller design based on subspace method[J]. Asian Journal of Control, 2011, 13(2): 345-349.(SCI/EI)",
         "Fang S, Li N, Li S. ‘Periodically-active phenomenon’of DIS-NCS with scattering transformation[J]. International Journal of Control, 2011, 84(8): 1467-1476.(SCI/EI)",
         "Chen M, Li N, Li S. An Interval Type-2 TS Fuzzy Model of Thermal Comfort Index PMV[J]. IFAC Proceedings Volumes, 2011, 44(1): 15007-15012.",
         "Wang M, Li N, Li S, et al. Model Predictive Control Design for Spatially-Distributed System based on Input-Output Data Sets[J]. IFAC Proceedings Volumes, 2011, 44(1): 3641-3646.",
         "Zheng Y, Li S, Li N. Distributed model predictive control over network information exchange for large-scale systems[J]. Control engineering practice, 2011, 19(7): 757-769.(SCI/EI)",
         "Shen Y, Li S, Li N, et al. Partial decoupling control for multivariable processes[J]. Industrial & Engineering Chemistry Research, 2011, 50(12): 7380-7387.(SCI/EI)",
         "Wang M, Li N, Li S, et al. Embedded interval type-2 TS fuzzy time/space separation modeling approach for nonlinear distributed parameter system[J]. Industrial & Engineering Chemistry Research, 2011, 50(24): 13954-13961.(SCI/EI)",
         "Li N, Liao Q, Hu X. Type-II TS fuzzy modelling for SCR flue gas denitration[J]. International Journal of Modelling, Identification and Control, 2010, 9(1-2): 199-205.(EI)",
         "Xue B, Li N, Li S, et al. Robust model predictive control for networked control systems with quantisation[J]. IET control theory & applications, 2010, 4(12): 2896-2906.(SCI/EI)",
         "Wang M, Li N, Li S. Local modeling approach for spatially distributed system based on interval type-2 ts fuzzy sets[J]. Industrial & Engineering Chemistry Research, 2010, 49(9): 4352-4359.(SCI/EI)",
         "Liao Qianfang, Li Ning, Li Shaoyuan. Type-II T-S fuzzy Model-based predictive control. 4193-4198, 2009. IEEE CDC-CCC, Shanghai (EI)",
         "Pan T H, Li S, Li N. Optimal bandwidth design for lazy learning via particle swarm optimization[J]. Intelligent Automation & Soft Computing, 2009, 15(1): 1-11.(SCI)",
         "Zhao M, Li N, Li S Y. Min-max model predictive control for constrained nonlinear systems via multiple LPV embeddings[J]. Science in China Series F: Information Sciences, 2009, 52(7): 1129-1135.(SCI)",
         "Min XU, Ning LI, Shaoyuan LI. A wide-range operating fuzzy control algorithm via receding horizon optimization, Journal of Intelligent and Fuzzy Systems, v 17, n 5, 2006, p 493-501, (SCI/EI 065110319505)",
         "Qinqin Fan, Min Jiang, Wentao Huang, Qingchao Jiang, and Ning Li. Considering Spatiotemporal Population Diversity in Dynamic Multi-objective Optimization. IEEE Transactions on Automation Science and Engineering,(Submitted)",
         "Z. Chen, L. Yu, N. Li. Reinforcement Learning-Based Distributed Optimization Algorithm for A Novel Cooperative Optimal Control of Multi-agents[J]. IEEE Transactions on Control of Network Systems.(Submitted)",
         "Liying Yu, Dewen Li, and Ning Li, Member, IEEE. Offline economic dispatch for multi-area power system via hierarchical reinforcement learning. IEEE Transactions on Power Systems.(Submitted)",
         "Mi Yan, Ning Li. Borderline-Margin Loss based Deep Metric Learning Framework for Imbalanced Data. Applied Intelligence. (Submitted)",
         "Mi Yan, Na Jiang, Ning Li. A Weighted Representation Learning based Feature Extraction Model for Multivariate Time Series Data in the Wind Turbine PHM System. IEEE Sensors Journal. (Submitted)", 

         "姜娜，严蜜，李柠. 基于时序上采样卷积神经网络的风机叶片结冰检测. 控制与决策. 2021",
         "Yiming Bian, Linghua Zhuang, Ning Li. Modeling and analysis of lithium-ion batteries for vehicles[J]. 控制工程. 2020-03",
         "张静，李柠，李少远，黄猛. 基于数据的风电机组发电机健康状况评估[J]. 信息与控制. 2018",
         "许裕栗，陈哲，李柠，甘中学. 变速变桨风力机系统的动态矩阵控制. 水电能源科学. 2018",
         "许裕栗，张静，李柠，甘中学，基于数据挖掘的锅炉在线运行状态监测. 热能动力工程. 2018",
         "李惠柯，张静，李柠. 基于复合神经网络的轴承退化评估和预测[J].控制工程. 2018",
         "许裕栗，杨晶，李柠，甘中学. Xgboost算法在区域用电预测中的应用[J]. 自动化仪表, 2018,39(07):1-5",
         "许裕栗，姜娜，陈卓，李柠，甘中学. 基于LSTM网络的居民区供热负荷短时预测. 自动化仪表. 2018",
         "姜娜，李柠，王华忠, 李少远. 重油常压塔硬件在环模拟仿真系统开发[J]. 自动化仪表, 2016, 37(8): 65-68.",
         "费爱玲，李柠，李少远. 固定翼无人机的自抗扰反步控制[J]. 控制理论与应用, 2016, 33(10): 1296-1302.",
         "胡楠，李少远，黄丹等. 高负载四足机器人的步态规划与控制[J].系统仿真学报, 2015, 27(3): 529-533.",
         "陈朦，李柠，李少远.室内舒适性指标PMV的区间II型T-S模糊建模.智能系统学报, 2011, 6(3): 219-224.",
         "胡赓，李柠，李少远. 空间分布系统的空间模糊建模[J]. 控制理论与应用, 2011, 28(2): 143-148.",
         "华晨，李柠，李少远. 分布参数系统的时空ARX建模及预测控制[J]. 控制理论与应用, 2011, 28(12): 1711-1716.",
         "张光明，李柠，李少远. 一种数据驱动的预测控制器性能监控方法[J]. 上海交通大学学报, 2011, 45(8): 1113-1118.",
         "胡学聪，李柠，李少远, 等. 基于Matlab的SCR烟气脱硝仿真平台设计[J]. 系统仿真学报, 2010 (1): 71-74.",
         "陈国洋，李柠，李少远. 一类T-S模糊控制系统的稳定性分析及设计[J]. 控制理论与应用，2010，23(3): 310-316.",
         "李谦，李柠，李少远. 利用点测量的分布参数系统状态重构[J]. 应用科学学报, 2010, 28(4): 430-435.",
         "冯超，李柠，李少远. 稀疏神经网络增长结构的学习算法[J]. 应用科学学报，2008, 26(2): 194-198.",
         "王梦灵，李柠，李少远. 带有测量噪声的Ⅱ型TS模糊建模[J]. 系统工程与电子技术, 2008, 30(10): 1957-1961.",
         "李惠柯，李柠，李少远. 基于SOM和改进ELM的轴承退化性能评估和预测(自动化学报，CPCC推荐)"
      ]
    },
    {
      "category": "Conference Papers",
      "items": [ 
         "Qinqin Fan, Yihao Wang, Okan K. Ersoy, Ning Li, Zhenzhong Chu. Dynamic Multi-objective Optimization via Sliding Time Window and Parallel Computing[C]//International Conference in Swarm Intelligence. Springer, Cham, 2021.",
         "Yuxiao Yang, Ning Li, Multi-stage Knowledge Enhancement for Ultra-fine-grained Entity Typing, 2021. International Symposium on Autonomous Systems.",
         "JIANG N, Ning Li. Wind turbine frequent principal fault detection based on a self-attentive LSTM encoder-decoder model[C]. 2020 39th Chinese Control Conference (CCC). IEEE",
         "Yiming Bian, Ning Li. Estimating remaining useful life for lithium-ion batteries using kalman filter banks. IEEE International Conference on Prognostics and Health Management, 2020",
         "Liying Yu, Ning Li. A reinforcement learning algorithm based on neural network for economic dispatch. Chinese Control Conference (CCC), 2020",
         "Xiangzhi Hu, Ning Li. Anomaly Detection and Remaining Useful Life Estimation Based on Degradation State for Bearings. Chinese Control Conference (CCC), 2020.",
         "Ye Nan, Li Ning. A Novel Active Object Detection Network Based on Historical Scenes and Movements. IEEE 3rd International Conference on Mechatronics, Robotics and Automation (ICMRA), 2020.",  
         "Gojko Perovic; Ning Li. Curiosity Driven Deep Reinforcement Learning for Motion Planning in Multi-agent Environment. IEEE International Conference on Robotics and Biomimetics, December 2019.",
         "N Song, X Hu, N Li. Anomaly detection of Wind Turbine Generator based on Temporal Information. ICIT 2019: Proceedings of the 2019 7th International Conference on Information Technology: IoT and Smart City. ",
         "Kang Zhiheng, Li Ning. PyramNet: Point Cloud Pyramid Attention Network and Graph Embedding Module for Classification and Segmentation. International Conference on Neural Information Processing (ICONIP). ",	
         "S. Kleff and N. Li, “A Sample-Data Hamilton-Jacobi Reachability Approach to Safe and Robust Motion Planning” in Proceedings of the 30th Chinese Control and Decision Conference (2018 CCDC), June 2018, pp. 3386-3392",
         "Shen Weizhou, Jiang Na, Li ning. An EMD-RF based short-term wind power forecasting method. DDCLS'18",
         "Chen, Z. Li, N. Distributed Cooperative Whale Optimization Algorithm . 2018 Chinese Process Control Conference",
         "Yang J, Li N, Li S. Two-layer PSDG Based Fault Diagnosis for Wind Turbines.[C]//Control Conference (CCC), 2017 36th Chinese. IEEE, 2017: 7148-7154.",
         "M. Javed, N. Li and S. Li. Personalized thermal comfort modeling based on Support Vector Classification.[C]// 2017 36th Chinese Control Conference (CCC), Dalian, China, 2017, pp. 10446-10451.",
         "X. Wang, N. Li and S. Li. Soft-sensing of carbon content of the catalyst in FCC based on deep learning.[C]// 2017 36th Chinese Control Conference (CCC), Dalian, China, 2017, pp. 4034-4039.",
         "Tan J,  Wang G, Li N, Eigen Entropy Based Optimal Neighborhood Selection in Point Cloud Feature Extraction and Description[C]//2017 28th Chinese Process Control Conference (CPCC), Chongqing, China, 2017.",
         "Zhang J,  Li N, and Li S,Health Assessment of Wind Turbine Generator Based on SCADA Data[C]//2017 28th Chinese Process Control Conference (CPCC), Chongqing, China, 2017.",
         "Wang G H, Li N, Li S. Enhanced histogram feature descriptor for automated point cloud registration[C]//Control Conference (CCC), 2016 35th Chinese. IEEE, 2016: 7032-7037.",
         "Li D, Tao X, Li N, et al. Gap metric based offline Multiple Model  Control[C]//Control Conference (CCC), 2016 35th Chinese. IEEE, 2016: 4324-4329.",
         "Li Huike, Li Ning, Li Shaoyuan. Bearing Health Assessment and Trend Prediction Based on SOM and Improved ELM. 2016 Chinese Process Control Conference.",
         "Chen Y, Li S, Li N. Complexity reduced explicit model predictive control by solving approximated mp-QP program[C]//Control Conference (ASCC), 2015 10th Asian. IEEE, 2015: 1-6.",
         "Yanting XU, Ning LI, Shaoyuan LI. A Data-driven Performance Assessment Approach for MPC Using Improved Distance Similarity Factor. The 10th IEEE Conference on Industrial Electronics and Applications.",
         "Chen Sheng, Li Ning, Li Shaoyuan. Building Personalized Thermal Comfort Profiles of HVAC System Based on Human On-line Learning. 2015 Chinese Process Control Conference. ",
         "Fei Ailing, Li Ning, Li Shaoyuan. Attitude and Velocity Control of a Fixed-Wing UAV Based on Back-Stepping Method. 2015 Chinese Process Control Conference. ",
         "Jiang Na, Li Ning, Wang Huazhong, LI Shaoyuan. The Development of Heavy Oil Fractionator Fardware in the Loop Simulation System. 2015 Chinese Process Control Conference. ",
         "Yang W, Li S, Li N. Station-keeping control method for GEO satellite based on relative orbit dynamics[C]//Intelligent Control and Automation (WCICA), 2014 11th World Congress on. IEEE, 2014: 1682-1687.",
         "Chen Y T, Li S Y, Li N. Performance analysis on dynamic matrix controller with single prediction strategy[C]//Intelligent Control and Automation (WCICA), 2014 11th World Congress on. IEEE, 2014: 1694-1699. ",
         "Cai X, Li S, Li N, et al. A unified framework for optimality analysis of model predictive control[C]//Intelligent Control and Automation (WCICA), 2014 11th World Congress on. IEEE, 2014: 1688-1693.",
         "Chen Y T, Li S Y, Li N. Performance analysis on dynamic matrix controller with single prediction strategy[C]//Intelligent Control and Automation (WCICA), 2014 11th World Congress on. IEEE, 2014: 1694-1699.",
         "Duan M, Li N, Li S. A modified LQG benchmark for economic performance assessment of model predictive control[C]//Control Conference (CCC), 2014 33rd Chinese. IEEE, 2014: 7811-7816.",
         "Xu Y, Li N, Li S. A data-driven performance assessment approach for MPC systems under multiple operating conditions[C]//Control Automation Robotics & Vision (ICARCV), 2014 13th International Conference on. IEEE, 2014: 919-924. ",
         "Luo Y, Li N, Li S. ANFIS modeling of the PMV thermal comfort index based on prior knowledge[C]//Industrial Electronics and Applications (ICIEA), 2014 IEEE 9th Conference on. IEEE, 2014: 214-219.",
         "Yin X, Li S, Li N, et al. Energy-saving-oriented control strategy for vapor compression refrigeration cycle systems[C]//Industrial Electronics and Applications (ICIEA), 2014 IEEE 9th Conference on. IEEE, 2014: 1561-1566.",
         "Wang Z, Huang D, Li N, et al. Quadruped robot gait planning with stair environment constraints[C]//Control Conference (CCC), 2014 33rd Chinese. IEEE, 2014: 8583-8588. ",
         "He X, Li S, Huang D, et al. Predictive preview trajectory tracking control for quadruped robots with Zero Moment Point[C]//Control Conference (CCC), 2014 33rd Chinese. IEEE, 2014: 8524-8529. ",
         "Chen K, Li S. Unfalsified adaptive PID control with a fading memory cost function[C]//Control Conference (CCC), 2014 33rd Chinese. IEEE, 2014: 5179-5183. ",
         "Luo Y, Li N, Li S. ANFIS Modeling of PMV Based on Hierarchical Fuzzy System[C]//International Conference on Intelligent Computing. Springer International Publishing, 2014: 727-738.",
         "Hu N, Li S, Huang D, et al. Trotting gait planning for a quadruped robot with high payload walking on irregular terrain[C]//Neural Networks (IJCNN), 2014 International Joint Conference on. IEEE, 2014: 581-587.",
         "Qingming Lin, Shaoyuan Li, Jing Wu, Ning Li ，TOU Price Optimization for Smart Grid Based on Users Response ，The 25th Chinses Process Control Conference, CPCC 2014, 2014/8/9-2014/8/11, 2014 ，ISTP ",
         "Wang P, Li N, Li S, et al. U models as universal approximators[C]//Modelling, Identification & Control (ICMIC), 2014 Proceedings of the 6th International Conference on. IEEE, 2014: 172-177. ",
         "Lu Wang, Ning Li, Shaoyuan Li. Performance monitoring of a data-driven subspace predictive controller based on historical objective function benchmark, 23rd Chinese Process Control Conference, Xiamen, China, 2012.",
         "Xue B, Li S, Li N. Moving horizon state estimation for constrained networked control systems with missing measurements[C]//Modelling, Identification & Control (ICMIC), 2012 Proceedings of International Conference on. IEEE, 2012: 719-724.",
         "Tao X, Hua C, Li N, et al. Robust model predictive controller design for a hypersonic flight vehicle[C]//Modelling, Identification & Control (ICMIC), 2012 Proceedings of International Conference on. IEEE, 2012: 1299-1304. ",
         "Wang L, Li N, Li S. Data-driven subspace identification and predictive control for a NIAT process platform[C]//Control and Decision Conference (CCDC), 2012 24th Chinese. IEEE, 2012: 1648-1653. ",
         "WANG Wei, LI Shaoyuan, Li Ning. A Real-time Modeling of Photovoltaic (PV) Array, Proceedings of the 23rd Chinese Process Control Conference, Xiamen, China, 2012. ",
         "Ma C, Li N, Li S. Maximum Power Point Tracking for Photovoltaic System Using Model Predictive Control[C]//International Conference on Intelligent Computing for Sustainable Energy and Environment. Springer Berlin Heidelberg, 2012: 515-523.",
         "Wang P, Li N, Li S. Stability analysis for TS fuzzy control systems with linear interpolations into membership functions[C]//Control Automation Robotics & Vision (ICARCV), 2012 12th International Conference on. IEEE, 2012: 1749-1754. ",
         "Wang P, Li N, Li S. Interval type-2 fuzzy TS modeling for a heat exchange process on CE117 Process Trainer[C]//Modelling, Identification and Control (ICMIC), Proceedings of 2011 International Conference on. IEEE, 2011: 457-462.",
         "Chen H, Ning L, Shaoyuan L. Switching multi-model predictive control for hypersonic vehicle[C]//Control Conference (ASCC), 2011 8th Asian. IEEE, 2011: 677-681.",
         "Fang S, Li N, Li S. “Staircase phenomenon” in delay-independently stable networked control system's dynamic response: Discrete-time case[C]//Control Conference (ASCC), 2011 8th Asian. IEEE, 2011: 199-204.",
         "Zhang G, Li N, Li S. Data-driven process monitoring method based on dynamic component analysis[C]//Control Conference (CCC), 2011 30th Chinese. IEEE, 2011: 5288-5293.",
         "Zhang G, Li N, Li S. A modified multivariate EWMA control chart for monitoring process small shifts[C]//Modelling, Identification and Control (ICMIC), Proceedings of 2011 International Conference on. IEEE, 2011: 75-80.",
         "Li Q, Li N, Li S. An optimal point-wise control method for parabolic distributed parameter systems[C]//Control Automation Robotics & Vision (ICARCV), 2010 11th International Conference on. IEEE, 2010: 1478-1482.(SCI/EI)",
         "Wang M, Li N, Li S. Type-2 TS fuzzy modeling for the dynamic systems with measurement noise[C]//Fuzzy Systems, 2008. FUZZ-IEEE 2008.(IEEE World Congress on Computational Intelligence). IEEE International Conference on. IEEE, 2008: 443-448. ",
         "Feng Chao, Li Ning, Li Shaoyuan. Learning Algorithms of Growing Sparse Neural Networks. International Conference on Modelling, Identification and Control, June 28-July 2, 2008(EI) ",
         "Wang Ruogu, Li Ning. A novel feature enhancement module for small object detection. 2022 IEEE International Conference on Industrial Technology.(Submitted)",
         "卞一鸣, 庄玲华, 李柠. 车载锂电池生热模型建模与分析[A]. 中国自动化学会过程控制专业委员会.第30届中国过程控制会议（CPCC 2019）",
         "胡祥志，庄玲华，李柠. BP-PID 算法在电动汽车空调温度控制中的应用.CPCC2019",
         "严蜜, 李柠, 甘中学. 基于非监督特征深度学习的手写数字识别.CPCC2018",
         "康志恒, 吴同茂, 李柠, 甘中学, 基于 LabVIEW 和 moRIO 的磁悬浮综合实验平台设计.CPCC2018",
         "宋娜, 邹卫军, 李柠, 甘中学. 激光武器跟踪平台的视频传输及同步显示软件设计.CPCC2018",
         "徐金玉，费飞，李柠.基于惯性传感器和Unity的运动捕捉系统.CPCC2018"
      ]
    },
    {
      "category": "Patent & Software Copyright",
      "items": [
         "（专利）叶楠，李柠。一种室内场景下的目标驱动视觉语义导航方法。申请时间：2021.03.15",
         "（专利）康志恒，王若谷，李柠。3D目标检测方法、系统、介质及终端。申请时间：2020.12.17，公开号：CN 112613378 A",
         "（专利）康志恒，李柠。三维数据的处理方法、系统及设备。申请时间：2019.08.29，公开号：CN110516751A",
         "（专利）徐金玉，李柠。一种风功率短期多步预测方法及装置。申请时间：2019.08.08，公开号：CN 110378541 A",
         "（专利）宋娜，李柠，卞一鸣。风机关键部件状态监测方法及装置、存储介质和终端。申请时间：2019.07.12，公开号：CN 110362048 A",
         "（专利）张静，李柠，宋娜，卞一鸣。发电机后轴承温度故障预测的方法、系统、存储器及控制器。申请时间：2019.05.15，公开号：CN 110135064 A ",
         "（专利）王锡磊，李柠。流化催化裂化中催化剂积碳测量方法、系统、介质及设备。申请时间：2018.05.18，公开号：CN108647485A",
         "（专利）杨晶，李柠。风电机组整机脆弱性分析与故障排序方法及电子终端。申请时间：2018.01.30，公开号：CN108074045A",
         "（专利）谈加杰，徐金玉，康志恒，宋娜，李柠，李恒涛。一种基于特征识别的教学辅助大数据智能分析方法。申请时间：2018.02.02，公开号CN108268854A",
         "（专利）李惠柯，张静，李柠。风机健康评估的方法、系统、存储器及控制器。申请时间：2017.06.30，公开号：CN107341349A",
         "（专利）黎德文，李柠。风机多模型预测控制方法、系统、存储器及控制器。申请时间：2017.06.27，公开号：CN107191328A",
         "（专利）陈胜，李柠。一种基于多用户热舒适度数据的暖通系统控制方法。申请时间：2017.02.28，公开号：CN107120782A ",        
         "（专利）王官皓，谈加杰，李柠。一种分布式结构化三维点云图像处理方法及系统。申请时间：2017.01.18，公开号：CN106844610A",  
         "（专利）李惠柯，李柠，李少远。一种轴承健康评估与预测的方法及系统。申请时间：2016.04.28，公开号：CN105975749A", 
         "（专利）罗一凡，李柠，李少远。一种用于室内热舒适度的检测方法。申请时间：2015.04.20，专利号：ZL201510189743.2", 
         "（专利）马超，李柠，李少远。一种光伏最大功率点实时跟踪预测控制方法。申请时间：2012.12.05，专利号：ZL201210514640.5", 
         "（专利）李少远，郑毅，李柠，席裕庚。热轧带钢层流冷却过程板带温度监测方法。申请时间：2009.01.08，专利号：ZL200910045033.7", 
         "（专利）李少远，李柠，郑毅，张艳。 网络信息交换模式下的工业生产全过程优化控制方法。申请时间：2008.01.24，专利号：ZL200810032995.4", 
         "（专利）廖倩芳，李柠，李少远，胡学聪。 基于区间II型模糊集的T-S模糊模型的建模系统。申请时间：2008.08.21，专利号：ZL200810041925.5", 
         "（软件著作权）王官皓，李柠。实时三维场景重构与精确定标系统软件(TRIVISION) V1.0 2017SR205890 ",
         "（软件著作权）徐彦婷，张光明，李柠，李少远。数据驱动的预测控制器性能监控仿真平台软件 V1.0, 2013-12-27 ",  
         "（软件著作权）胡学聪，李柠，李少远，廖倩芳。SCR法烟气脱硝仿真模拟平台 (SCR-SP) V1.0, 2008SR24162 ", 
         "（软件著作权）李少远，李柠，郑毅。中厚板加速冷却过程先进控制算法仿真验证平台(ACCSP) V1.0, 2008SR02431" 
      ]
    }
  ]
}
