{
  "usage": "index of research areas",
  "micropage": "http://u1755815.jisuwebapp.com/s?id=2941259",
  "entry": [
    {
      "name": "Model Predictive Control",
      "link": "",
      "figures": ["yckz1.jpg","yckz2.png","yckz3.jpg"],
      "description": "<p>Model predictive control (MPC) is a closed-loop optimal control strategy based on model. The core of the algorithm is predictable future dynamic model, online repeated optimization calculation and rolling control effect and model error feedback correction. The model predictive control has the advantages of good control effect and strong robustness, which can effectively overcome the uncertainties, nonlinearity and parallelism of the process, and can conveniently handle the various constraints in the manipulated variables. We study the the MPC algorithm and focus on the following researches: (1) Multiple Model Predictive Control (MMPC). MMPC utilizes a linear model bank to handle the nonlinearity of system and transfers nonlinear MPC to linear MPC. (2) Performance limit analysis of predictive control system. Performance limit analysis focus on the best performance index that the system might achieve and provide the basis for the design of the control system.</p>  <p>Case study: Wind power generation's control</p>"
    },
    {
      "name": "Big Data Analysis",
      "link": "",
      "figures": [],
      "children": [
        {
          "name": "Data-driven Fault Diagnosis of syetem",
          "link": "",
          "figures": ["gzzd1.png","gzzd2.png","gzzd3.png"],
          "description": "<p>Due to the coupling between components of industrial system, there is a phenomenon that a faults-chain will be caused by a principal fault. In order to carry out operation and maintenance efficiently, it is necessary to locate the principal fault accurately. We focus on how to make use of data recorded for principal fault location of faults-chain. A Principal Fault Location (PFL) model are presented based on deep learning and semi-supervised learning algorithm. Data preprocessing methods are studied to obtain good data. Deep Learning models are applied and improved to extract features from data automatically. Based on the mass of unlabeled data, we proposed a Graphical Temporal Semi-Supervised Learning algorithm to develop our training set. </p>  <p>Case study: Principal Fault Location of Faults-Chain in Wind Turbine System</p>"
        },
        {
          "name": "Health management of Equipment",
          "link": "",
          "figures": ["jkgl1.png","jkgl2.png","jkgl3.png"],
          "description": "<p>Take full account of the multi-dimensional state information and the changes in operating conditions of the equipment. By collecting and analyzing great quantity of data from the running equipment, study the equipment monitoring model to determine the current health of the equipment and detect the latent failure timely based on machine learning and other related algorithms. Provide reasonable recommendations in order to ensure the safety, efficient operation and maintenance of the equipment.</p>  <p>Case study: Health management of wind tuibine</p>"
        },
        {
          "name": "Soft sensing",
          "link": "",
          "figures": ["rcl1.png","rcl2.jpg","rcl3.png"],
          "description": "<p>Soft sensing technique is an effective method to solve such kind of problem that variables can’t be measured directly in industrial process, it overcomes the time lag problem of off-line artificial sampling and analysis, and it has received extensive attention from petrochemical enterprise. Generally, soft sensing is a method based on traditional measuring methods. It selects a set of secondary variables which are closely related to the primary variables and easier to be measured precisely in an industrial process to instead of the direct measuring of primary variables. It calculates the values of primary variables indirectly by using the relationship between secondary and primary variables. The selection of secondary variables is generally according to the mechanism process and determine the variables which influence the values of the primary variables directly.Using the soft-sensing technology to achieve the online detection of element content is not only economic and reliable,but also has a rapid dynamic response,which is easy to achieve the control of product quality.</p>  <p>Case study: Soft sensing in petrochemical industry</p>"
        }
      ]
    },
    {
      "name": "3D Reconstruction",
      "link": "",
      "figures": ["swcg1.png","swcg2.png","swcg3.png"],
      "description": "<p>Reconstruction and perception of 3D environment serve as an important prior for automated systems, by providing task-relevant information about workspace. Realated works aimed to build a framework for reconstruction and analysis of visual information presented in scenes, including category, position, and pose of objects. Due to the intrinsic large-scale and nonuniform characteristics, this topic encounters key issues such as robustness, efficiency and feasibility. Our contributions have been validated by simulations and tests deployed in production environment. Featured contributions including: (1) enhanced feature descriptors outperforms existing methods on run-time, while maintains the discriminative power; (2) dimensional-reduced method can percepts object properties at real-time speed; (3) distributed structured point cloud supports real-time conversion, with ultra-fast processing speed that is distinctly better than traditional point cloud.</p>  <p>Case study: Scene reconstruction and perception</p>"
    },
    {
      "name": "本科生PRP项目：基于Matlab的新能源电动车热管理控制系统仿真研究",
      "link": "",
      "figures": ["prp1.png","prp2.png","prp3.png"],
      "description": "<p>为了应对全球能源危机和环境污染，新能源电动车因其无污染、噪声低、节能等特点备受青睐，目前，如何最大限度发挥电池使用性能，合理分配有限的电池能量是需要不断研究的问题。针对此问题所开展的本PRP项目由李运鸿、吕东旭、李启开三名本科同学参与完成，工作内容分别是：1.通过对电动汽车车内热负荷的计算和空调系统制热机理的分析，完成电动车热负荷建模和空调系统制热能耗建模  2.通过对电动车空调系统中制冷系统工作流程的分析，对制冷模块的关键部件压缩机进行了建模并完成了相应的仿真  3.针对新能源电动汽车的平流式冷凝器-膨胀阀-蒸发器进行仿真分析，完成了制冷系统的整体建模和参数调试，同时联合Refprop和matlab2016a软件，实现了界面的可视化。</p>"
    }
  ]
}