{
  "usage": "index of research areas",
  "micropage": "http://u1755815.jisuwebapp.com/s?id=2941259",
  "entry": [
    {
      "name": "Optimization",
      "link": "",
      "figures": [],
      "children": [
        {
          "name": "Optimization and Reinforcement Learning",
	  "link": "",
          "figures": [],
          "description": "<p>Reinforcement learning (RL) is a class of learning problems framed in the context of planning on a Markov Decision Process (MDP), when the MDP is not known. In RL, an agent continually interacts with the environment. In particular, the agent observes the state of the environment, and based on this observation takes an action. The goal of the RL agent is to compute a policy–a mapping between the environment states and actions–that maximizes a long term reward. Many system optimization problems have a nature of delayed, sparse, aggregated or sequential rewards, where improving the long term sum of rewards is more important than a single immediate reward. Reinforcement learning algorithm can be classified as value-based which the agent is expecting a long-term return of the current states under policy π and policy-based which you try to come up with such a policy that the action performed in every state helps you to gain maximum reward in the future.</p>"
        },
        {
          "name": "Optimization and stochastic optimization method",
          "link": "",
          "figures": ["osom1.png"],
          "description": "<p>The stochastic optimization method is a kind of modern intelligent optimization technique that stimulates the mechanism of how things work in nature. The biggest advantage of the stochastic optimization method is that it can solve optimization problems with non-convex, non-smooth, discontinuous objective functions, which is infeasible for conventional mathematic optimization techniques. However, the standard stochastic optimization techniques, such as simulated annealing(SA), genetic algorithms(GA), tabu search(TS), and particle swarm optimization(PSO), suffer from the exploration and exploitation problem, as well as the robustness problem in solution quality, which is our main focus now.</p>  <p>Case study: non-convex, non-smooth, discontinuous optimization</p>"
        },
        {
          "name": "Optimization and Analytical Method",
          "link": "",
          "figures": [],
          "description": "<p>The constrained optimization problem plays an import role in various fields. The primal-dual dynamic seeks the saddle point for a constrained optimization problem and is widely used to the distributed solution design. When considering the inequality constraints, a positive projector is often needed to guarantee the nonnegativity of the Lagrange multiplier. That results in a discontinuous Lyapunov function and makes the stability analysis tough. Our research develops smooth algorithms based on the generalized Lagrangian and proves the stability by a continuous Lyapunov function.  We also explore the distributed optimization algorithm for problems with nonconvex local functions.</p>"
        },
        {
          "name": "Optimization and Optimal Control",
          "link": "",
          "figures": [],
          "description": "<p>Compared with traditional optimal control problem, data-driven optimal control algorithm combined with reinforcement learning shows its effectiveness in it less requirement on system dynamics and its high computational efficiency. The current literatures focus more on the infinite horizon case. Therefore, our research puts forward the online model-free reinforcement learning algorithm of the optimization problem in finite horizon case. Then we want to extend this algorithm to more complicated systems such as the zero-sum games and multiplayer games，Finally these algorithms are applied to solving the optimal control dynamic dispatch problem.</p>"
        }
      ]
    },
    {
      "name": "Machine Learning",
      "link": "",
      "figures": [],
      "children": [
        {
          "name": "Data driven Fault Diagnosis and Detection (FDD) method",
          "link": "",
          "figures": ["ddfdadm1.jpg"],
          "description": "<p>Data driven Fault diagnosis and detection (FDD), as an important technique to reduce the damage of components and improve system reliability, has been developed by researchers during the past decades. With the fast development of intelligent monitoring technology, internet information technology, and data storage technology, data-driven FDD method has become an attractive and successful type of FDD methods. The data-driven FDD method applies machine learning algorithms and statistical approaches to analyze historical data and extract implicit relationships. Many machine learning algorithms, such as Gaussian Mixture Model (GMM), Artificial Neural Network (ANN), Support Vector Machine (SVM), and Deep Learning (DL), are introduced into the data-driven FDD. However, dataset imbalance problem, weakly labeled problem, few-shot problem, and novel online FDD problem still need further researches, which is our main focus now.</p>"
        },
        {
          "name": "Data-driven Fault Detection for Wind Turbines",
          "link": "",
          "figures": [],
          "description": "<p>As clean and sustainable energy generators, wind turbines (WT) receive spread usage and continuous progress on installed capacity, built scale, and WT structural complexity, which results in growing failure rate and attention to WT maintenance likewise. To guarantee power persistence and steadiness, fault detection (FD) methods have been introduced to modern wind farms located in severe environments and monitor WT operating status. Advanced WT is a complicated cross-domain system containing hydraulic, mechanical, electrical subsystems, such as pitch and yaw system, multi-speed gearbox, and DFIG and dual-side converters. Besides these key subsystems, others like bearings, lube and cooling system, control system, and capacitors may also break down then bring whole WT into fault conditions, which inspires WT multiple subsystems FD. Furthermore, problems of WT faults featured as faulted subsystem unpredictability and subsystems interaction (i.e. the chain rule), real-time big-data detection, and various environments and operating conditions transferring have put forward tough demands for WT fault detection, which also increases complexity and hinders precise modeling for WT system. In fact, the FD of WTs should be towards multiple subsystems by cross-domain inputs and WT conditions should be considered.</p>"
        },
        {
          "name": "Deep Metric Learning for Nonlinear and Imbalanced data",
          "link": "",
          "figures": ["dmlfnaid1.png"],
          "description": "<p>Metric learning is an important branch of machine leaning and aims to automatically construct task- specific distance metrics from (weakly) supervised data. The learned metric can be used in recommendation systems, face recognition, and social network analysis, etc. Traditional metric methods (such as Euclidean distance, Mahalanobis distance) are generally applied to linearly separable data, but the practical data are usually nonlinear and imbalanced. In recent years, a lot of research has been studied in the theory, algorithm and application of metric learning. However, for non-linear and imbalanced data, how to obtain the explicit solution of its feature mapping and speed up the learning process still need further investigation. In the last several years, deep learning has gained rapid development in the areas of pattern recognition, computer vision and natural language processing. The powerful learning capability of deep learning offers new route to the research of metric learning.</p>"
        },
        {
          "name": "Few-shot learning (FSL)",
          "link": "",
          "figures": ["fsl1.png"],
          "description": "<p>Humans are good at using very few samples to identify new objects. Inspired by this fast learning ability, few-shot learning (FSL) hopes that machine learning models can learn quickly for new categories with only a small number of samples, after training with a large amount of data for certain categories. As an application of meta-learning in supervised learning, FSL decomposes data into different meta-tasks in the meta-training stage, in order to learn the generalization ability of the model when the category changes. In the meta-testing stage, classification can be completed without completing existing models facing new categories. Currently, FSL research is mainly focused on image files, while others have extended it to NLP. In the future, FSL will play a greater role in more fields.</p>"
        },
        {
          "name": "Machine Vision",
          "link": "",
          "figures": ["mv1.png","mv2.png"],
          "description": "<p>Active object detection (AOD) aims at getting a better image for detection by gradually altering the robot view of the object. It is more effective than traditional object detection when facing the following problems: the object in the image is of tiny scale, the object is blocked by other irrelevant objects, the object is partially captured by the camera, etc. There are several methods to achieve AOD: (1) Using entropy increasing of the current and future images to determine the best position at the next moment. (2) Constructing a specific physical model for analysis. (3) Constructing an action decision model based on CNN to decide the next best view. (4) ….. Methods can be evaluated on the open-source dataset “Action Vision Dataset”. It provides a stable experiment environment.</p>  <p>Case study: AOD based on CNN</p>"
        },
        {
          "name": "Remaining useful life estimation",
          "link": "",
          "figures": ["rule1.png"],
          "description": "<p>Remaining useful life (RUL) refers to the number of time(rounds) left before machine breaks down, which is a main research topic in prognostics and health management (PHM). We aim at extracting degrading related features from original signals to estimate RUL. Both data-driven and model-based methods are adopted, including deep learning, ensemble learning, Kalman filters and so on. Efforts are made to do RUL estimation on a variety of industrial components, such as roller bearings, cutting tools, lithium-ion batteries, aircraft engines and so on.</p>"
        }
      ]
    }
  ]
}
