{
  "usage": "index of research areas",
  "micropage": "http://u1755815.jisuwebapp.com/s?id=2738220",
  "entry": [
    {
      "name": "Model Predictive Control",
      "link": "",
      "figures": ["yckz1.jpg","yckz2.png","yckz3.jpg"],
      "description": "<p>Model predictive control (MPC) is a closed-loop optimal control strategy based on model. The core of the algorithm is predictable future dynamic model, online repeated optimization calculation and rolling control effect and model error feedback correction. The model predictive control has the advantages of good control effect and strong robustness, which can effectively overcome the uncertainties, nonlinearity and parallelism of the process, and can conveniently handle the various constraints in the manipulated variables. We study the the MPC algorithm and focus on the following researches: (1) Multiple Model Predictive Control (MMPC). MMPC utilizes a linear model bank to handle the nonlinearity of system and transfers nonlinear MPC to linear MPC. (2) Performance limit analysis of predictive control system. Performance limit analysis focus on the best performance index that the system might achieve and provide the basis for the design of the control system.</p>  <p>Case study:Wind power generation's control</p>"
    },
    {
      "name": "Big Data Analysis",
      "link": "",
      "figures": [],
      "children": [
        {
          "name": "Data-driven Fault Diagnosis of syetem",
          "link": "",
          "figures": ["gzzd1.png","gzzd2.png","gzzd3.png"],
          "description": "<p>The main tasks of fault diagnosis of system are: fault detection, fault type judgment, fault location and fault recovery.Fault detection is to establish a connection with the system to send detection signals to the next bit machine periodically and determine whether the system failure from the response of data frame.Fault type judgment is to determine the type of system failure by analyzing the causes after the system detects the fault.Fault location,based on the first two, is the diagnosis of specific fault parts of the system and the cause of the failure to prepare for the recovery.Fault recovery is the final and the most important part of the whole fault diagnosis process. It needs to take different measures to recover the system fault according to the fault reason.</p>  <p>Case study:Wind turbine's fault diagnosis</p>"
        },
        {
          "name": "Health management of Equipment",
          "link": "",
          "figures": ["jkgl1.png","jkgl2.png","jkgl3.png"],
          "description": "<p>The main tasks of Equipment's health management are judging the health extent of the equipment and research the dynamic damage regulation in order to design health assessment on equipment and research how to keep equipment running at low cost and efficiently. By collecting and analyzing great quantity of data from the running equipment, information of health extent of equipment is obtained and thus the policy to adjust the operation of equipment can be researched.The whole process is what health management's work focus on.</p>  <p>Case study:Health management of wind tuibine</p>"
        },
        {
          "name": "Soft sensing",
          "link": "",
          "figures": ["rcl1.png","rcl2.jpg","rcl3.png"],
          "description": "<p>Soft sensing technique is an effective method to solve such kind of problem that variables can’t be measured directly in industrial process, it overcomes the time lag problem of off-line artificial sampling and analysis, and it has received extensive attention from petrochemical enterprise. Generally, soft sensing is a method based on traditional measuring methods. It selects a set of secondary variables which are closely related to the primary variables and easier to be measured precisely in an industrial process to instead of the direct measuring of primary variables. It calculates the values of primary variables indirectly by using the relationship between secondary and primary variables. The selection of secondary variables is generally according to the mechanism process and determine the variables which influence the values of the primary variables directly.Using the soft-sensing technology to achieve the online detection of element content is not only economic and reliable,but also has a rapid dynamic response,which is easy to achieve the control of product quality.</p>  <p>Case study:Soft sensing in petrochemical industry</p>"
        }
      ]
    },
    {
      "name": "3D Reconstruction",
      "link": "",
      "figures": ["swcg1.png","swcg2.png","swcg3.png"],
      "description": "<p>Reconstruction and perception of 3D environment serve as an important prior for automated systems, by providing task-relevant information about workspace. Realated works aimed to build a framework for reconstruction and analysis of visual information presented in scenes, including category, position, and pose of objects. Due to the intrinsic large-scale and nonuniform characteristics, this topic encounters key issues such as robustness, efficiency and feasibility. Our contributions have been validated by simulations and tests deployed in production environment. Featured contributions including: (1) enhanced feature descriptors outperforms existing methods on run-time, while maintains the discriminative power; (2) dimensional-reduced method can percepts object properties at real-time speed; (3) distributed structured point cloud supports real-time conversion, with ultra-fast processing speed that is distinctly better than traditional point cloud.</p>  <p>Case study:Scene reconstruction and perception</p>"
    }
  ]
}